configuration/src/InformationRegisters/ReportsSnapshots/ReportsSnapshots.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReportsSnapshots</name>
  <resources>
    <name>ReportResult</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>UpdateDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>LastViewedDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>UserSetting</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportUpdateError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Report</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Variant</name>
    <type>
      <types>CatalogRef.ReportsOptions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UserSettingsHash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</comment>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsInternal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteInfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ReportsSnapshots/Forms/ReportViewForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlersForm
 
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	InformationSecurityUserSUID = InfoBaseUsers.CurrentUser().UUID;
	User = Catalogs.Users.FindByAttribute("IBUserID",
		New UUID(InformationSecurityUserSUID));
	
	CatalogNameReportOptions = "";
	Parameters.Property("CatalogNameReportOptions", CatalogNameReportOptions);
		
	ReportVariant = Undefined;
	If Parameters.Property("ReportVariant", ReportVariant) Then
		For Each SubordinateItem In Items.ButtonGroupViewReportsNested.ChildItems Do
			If SubordinateItem.Name <> "GroupButtonsDeleteReportSnapshot" Then
				SubordinateItem.Enabled = False;
			EndIf;
		EndDo;
	EndIf;
		
	UpdateReportsSnapshots(CatalogNameReportOptions, ReportVariant);

	If ReportsSnapshots.Count() > 0 Then
		CurrentReportSnapshot = 1;
		ReadReportSnapshot();
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure ReportsSnapshots(Command)
	
	OpenForm("InformationRegister.ReportsSnapshots.ListForm",
				New Structure("User", User));
	
EndProcedure

&AtClient
Procedure GoToEnd(Command)
	
	CurrentReportSnapshot = ReportsSnapshots.Count();
	ReadReportSnapshot();
	
EndProcedure

&AtClient
Procedure GoToBegin(Command)

	If ReportsSnapshots.Count() > 0 Then
		CurrentReportSnapshot = 1;
		ReadReportSnapshot();
	EndIf;

EndProcedure

&AtClient
Procedure GoBack(Command)
	
	If CurrentReportSnapshot > 1 Then
		CurrentReportSnapshot = CurrentReportSnapshot - 1;
		ReadReportSnapshot();
	EndIf;
	
EndProcedure

&AtClient
Procedure GoForward(Command)
	
	If CurrentReportSnapshot < ReportsSnapshots.Count() Then
		CurrentReportSnapshot = CurrentReportSnapshot + 1;
		ReadReportSnapshot();
	EndIf;
	
EndProcedure

&AtClient
Procedure DeleteReportSnapshot(Command)
	
	If CurrentReportSnapshot <> 0 Then
		DeleteReportSnapshotAtServer();
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure UpdateReportsSnapshots(CatalogNameReportOptions, ReportVariant)
	
	UserReportsSnapshots = InformationRegisters.ReportsSnapshots.UserReportsSnapshots(User, CatalogNameReportOptions);
	UserReportsSnapshots.FillValues(User, "User");
	
	If ValueIsFilled(ReportVariant) Then
		Counter = 0;
		While Counter < UserReportsSnapshots.Count() Do
			If UserReportsSnapshots[Counter].Variant = ReportVariant Then
				Counter = Counter + 1;
			Else
				UserReportsSnapshots.Delete(Counter);
			EndIf;
		EndDo;
	EndIf;	
	
	ReportsSnapshots.Load(UserReportsSnapshots);
	
EndProcedure

&AtServer
Procedure ReadReportSnapshot()
	
	RowReport = ReportsSnapshots[CurrentReportSnapshot-1];
	
	ReportSpreadsheetDocument.Clear();
	UpdateDate = Undefined;
	
	RecordManager = InformationRegisters.ReportsSnapshots.CreateRecordManager();
	FillPropertyValues(RecordManager, RowReport);
	RecordManager.Read();
	If RecordManager.Selected() Then
		If RecordManager.ReportUpdateError Then
			Common.MessageToUser(NStr(
				"en = 'An error occurred when saving the report snapshot: save the snapshot again.';"));
		Else
			ReportResult = RecordManager.ReportResult.Get();
			If TypeOf(ReportResult) = Type("SpreadsheetDocument") Then
				ReportSpreadsheetDocument.Put(ReportResult);
				RecordManager.LastViewedDate = CurrentSessionDate();
				RecordManager.Write();
			Else
				Common.MessageToUser(NStr(
					"en = 'An error occurred when reading the report snapshot: the data is incorrect.';"));
			EndIf;
		EndIf;
		UpdateDate = RecordManager.UpdateDate;
	Else
		Common.MessageToUser(NStr("en = 'An error occurred when reading the report snapshot: the report is deleted.';"));
	EndIf;
	
	Title = NStr("en = 'Last updated';") + ": " + UpdateDate;
	
EndProcedure

&AtServer
Procedure DeleteReportSnapshotAtServer()
	
	RowReport = ReportsSnapshots[CurrentReportSnapshot-1];
	
	ReportSpreadsheetDocument.Clear();
	
	RecordManager = InformationRegisters.ReportsSnapshots.CreateRecordManager();
	FillPropertyValues(RecordManager, RowReport);
	RecordManager.Read();
	If RecordManager.Selected() Then
		RecordManager.Delete();
	EndIf;
	
	ReportsSnapshots.Delete(RowReport);
	
	If CurrentReportSnapshot > ReportsSnapshots.Count() Then
		CurrentReportSnapshot = ReportsSnapshots.Count();
	EndIf;
	
	If CurrentReportSnapshot > 0 Then
		ReadReportSnapshot();
	EndIf;
	
EndProcedure

#EndRegion
